Revit 2027 API
RebarConstraint.IsReferenceValidForConstraint Method
Note: This API is now obsolete.
 Checks if the reference provided can be used in creating 'ToFace' or 'ToCover' Rebar constraints
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This property is deprecated in Revit 2027 and might be removed in a future version. Use the RebarConstraint.isReferenceAValidFaceForConstraint().")]
public bool IsReferenceValidForConstraint(
	Reference targetReference
)
<ObsoleteAttribute("This property is deprecated in Revit 2027 and might be removed in a future version. Use the RebarConstraint.isReferenceAValidFaceForConstraint().")>
Public Function IsReferenceValidForConstraint (
	targetReference As Reference
) As Boolean
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2027 and might be removed in a future version. Use the RebarConstraint.isReferenceAValidFaceForConstraint().")]
bool IsReferenceValidForConstraint(
	Reference^ targetReference
)
[<ObsoleteAttribute("This property is deprecated in Revit 2027 and might be removed in a future version. Use the RebarConstraint.isReferenceAValidFaceForConstraint().")>]
member IsReferenceValidForConstraint :
        targetReference : Reference -> bool
Parameters
targetReference Reference
 The reference to be checked.
Return Value
Boolean
 Returns true if reference can be used in a constraint of 'ToFace' or 'ToCover' type, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover'.
Remarks
 Reference is valid if it points to an uncut face of a structural that can host Rebar.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace